#! /usr/bin/env python
# -*- coding: utf-8 -*-
# __author__ = "Wu Zhi Bin"
# Email: wuzhibin05@163.com
# Date: 2021/4/2

# =============================== 题目 ==========================================
#  1,使用while循环输入1到10

# 2,求1-100的所有数的和

# 3,求1-100内所有奇数

# 4,求1-100内所有偶数

# 5,求1-2+3-4+5 ... 99的所有数的和。

# 6,要求用户输入0-100的数字后，你能正确打印他的对应成绩(考察 if 条件结构)
# A    90-100
# B    80-89
# C    60-79
# D    40-59
# E    0-39

# 7,用户登陆（三次机会重试）。

# ================================ 答案 =========================================
